app/controllers/events_controller.rb

  def index
    #Comming events (ascending order) in @events[0] and archived events (descending order) in @events[1]
    @events = [Event.all(:conditions => "datetime >= '" + Date.today.to_s(:db) + "'", :order => "datetime" ),
    Event.all(:conditions => "datetime < '" + Date.today.to_s(:db) + "'", :order => "datetime desc" ) ]
---
SELECT * FROM "events" WHERE (datetime >= 2010-10-15) ORDER BY datetime

  def indexlight
    @events = Event.all(:limit =>3, :conditions => "datetime >= #{Date.today.to_s(:db)}", :order => "datetime" )
---
SELECT * FROM "events" WHERE (datetime >= 2010-10-19) ORDER BY datetime

  def register
    # link the user to the event
    # get the event
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)

  def unregister
    @user = current_user
    # get the event
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "price", "created_at", "updated_at", "description", "datetime") VALUES('Premier séminaire Agile au Maroc', 0.0, '2010-10-05 18:56:43', '2010-10-05 18:56:43', 'Agile Agile Agile Agile Agile Agile Agile Premier séminaire Agile au Maroc Agile Agile Agile Agile Agile Agile Agile Premier séminaire Agile au Maroc Agile Agile Agile Agile Agile Agile Agile Premier séminaire Agile au Maroc Agile Agile Agile Agile Agile Agile Agile Premier séminaire Agile au Maroc Agile Agile Agile Agile Agile Agile Agile Premier séminaire Agile au Maroc Agile Agile Agile Agile Agile Agile Agile Premier séminaire Agile au Maroc ', '2010-11-17 00:00:00')

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)
UPDATE "events" SET "description" = 'For instance, if a Team is not able to do performance, regression, stability, security, and integration testing for each Product Backlog item, the proportion of this work to the work that can be done (analysis, design, refactoring, programming, documentation, unit and user testing) is calculated. Let’s say that this proportion is six pieces of “done” and four pieces on “undone.” If the Team finishes a Product Backlog item of six units of work (the Team is estimating based on what it knows how to “do”), four is added to the “undone work” Product Backlog item when they are finished.', "datetime" = '2010-05-03 00:00:00', "updated_at" = '2010-04-06 03:08:49' WHERE "id" = 4

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
DELETE FROM "events" WHERE "id" = 1