app/controllers/messages_controller.rb

   def index
    @messages = Message.all
---
SELECT * FROM "messages"

  def show
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)

  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      @message.datetime= Time.now
      if @message.save
---
INSERT INTO "messages" ("created_at", "body", "from", "updated_at", "datetime") VALUES('2010-10-14 19:28:48', 'moi 1', 'see', '2010-10-14 19:28:48', '2010-10-14 19:28:48')