app/controllers/news_controller.rb

  def index
    @news = News.all
---
SELECT * FROM "news"

  def show
    @news = News.find(params[:id])
---
SELECT * FROM "news" WHERE ("news"."id" = 0)

  def edit
    @news_item = News.find(params[:id])
---
SELECT * FROM "news" WHERE ("news"."id" = 1)

  def create
    @news_item = News.new(params[:news])

    respond_to do |format|
      if @news_item.save
---
INSERT INTO "news" ("created_at", "title", "body", "updated_at", "datetime") VALUES('2010-10-20 21:16:01', 'First news', 'Bala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala Bla.

  def update
    @news_item = News.find(params[:id])

    respond_to do |format|
      if @news_item.update_attributes(params[:news])
---
SELECT * FROM "news" WHERE ("news"."id" = 1)
UPDATE "news" SET "updated_at" = '2010-10-21 19:18:50', "body" = 'Bala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala BlaBala Bla.

  def destroy
    @news = News.find(params[:id])
    @news.destroy
---
SELECT * FROM "news" WHERE ("news"."id" = 2)
DELETE FROM "news" WHERE "id" = 2